---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AutoJoinCondition
source: html/236556b7-da39-7dc9-834f-d2556c938f76.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AutoJoinCondition Property

"Join Condition"

## Syntax (C#)
```csharp
public static ForgeTypeId AutoJoinCondition { get; }
```